Revit 2024 API
Document.Settings Property
Provides access to general application settings, such as Categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Settings Settings { get; }
Visual Basic
Public ReadOnly Property Settings As Settings
	Get
Visual C++
public:
property Settings^ Settings {
	Settings^ get ();
}
Remarks
Returns an object that provides access to various settings within Autodesk Revit. The Settings property returns an object that provides access to the categories within the Autodesk Revit project.
See Also
Document Class
Autodesk.Revit.DB Namespace